IDEA Open Model
CrossSectionFactory.FillBox2 Method
Compatible with IDEA StatiCa 20.1
 Box 2 - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillBox2(
	CrossSectionParameter css,
	double bu,
	double bb,
	double hw,
	double b1,
	double tw,
	double tfu,
	double tfb
)
Public Shared Sub FillBox2 (
	css As CrossSectionParameter,
	bu As Double,
	bb As Double,
	hw As Double,
	b1 As Double,
	tw As Double,
	tfu As Double,
	tfb As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu
Type: System.Double
Width of upper flange
bb
Type: System.Double
Width of bottom flange
hw
Type: System.Double
Height of web
b1
Type: System.Double
Web distance
tw
Type: System.Double
Web thickness
tfu
Type: System.Double
Upper flange thickness
tfb
Type: System.Double
Bottom flange thickness
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace